'''3. Напишите программу, удаляющую из текста все
слова, содержащие"абв"'''
print(''.join(input().lower().split('абв')))